src/InformationRegisters/гф_ДанныеВыгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>гф_ДанныеВыгрузки</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/гф_ОшибкиЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>гф_ОшибкиЗагрузки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПутьФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/гф_ДанныеВыгрузки/Ext/RecordSetModule.bsl
&Вместо("ПередЗаписью")
Процедура гф_ПередЗаписью(Отказ, Замещение)
	// #wortmann { 
	// Проверка на заполненность измерения "Документ" при виде данных "Документ" 
	// Галфинд_Домнышева 2023/07/26
	Для Каждого ТекЗапись Из ЭтотОбъект Цикл
		Если ТекЗапись.ВидДанных = Перечисления.гф_ВидыДанныхДляВыгрузки.Документ 
			И НЕ ЗначениеЗаполнено(ТекЗапись.Документ) Тогда
			Попытка	
				МенеджерЗаписи = РегистрыСведений.гф_ОшибкиЗагрузки.СоздатьМенеджерЗаписи(); 				
				МенеджерЗаписи.Дата = ТекущаяДатаСеанса();
				МенеджерЗаписи.ПутьФайла = ТекЗапись.ИмяФайла; 
				МенеджерЗаписи.Номер =  "000";
				МенеджерЗаписи.ТекстОшибки = "Не выполнена запись в РС ""ДанныеВыгрузки"", не заполнено значение ""Документ""";
				МенеджерЗаписи.Интерфейс = Перечисления.гф_Интерфейсы.WMS;
				МенеджерЗаписи.ТипИнформации = "Ошибка";
				МенеджерЗаписи.Записать(); 
				
			Исключение
				СообщениеОбОшибке = "Ошибка при записи файла " + ТекЗапись.ИмяФайла  
				+ ". Описание ошибки: Не удалось загрузить ТекстОшибки в РС гф_ОшибкиЗагрузки. " + ОписаниеОшибки();
				ЗаписьЖурналаРегистрации("Ошибка", УровеньЖурналаРегистрации.Ошибка, ЭтотОбъект, ЭтотОбъект, СообщениеОбОшибке);		
			КонецПопытки;
			Отказ = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	// } #wortmann
	ПродолжитьВызов(Отказ, Замещение);
КонецПроцедуры
